app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Shafiu Yushawu Ibn"], ["icon", "Shafiu Yushawu Ibn"], ["user_id", 1], ["created_at", "2023-07-06 16:38:43.036407"], ["updated_at", "2023-07-06 16:38:43.036407"]]
---
  def create
    @category = Category.new(name: category_params[:name], icon: category_params[:icon], user_id: current_user.id)

    if @category.save