app/controllers/entities_controller.rb

  def index
    @category = Category.find(params[:category_id])
    @entities = @category.entities
    @categories = current_user.categories.all
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "categories"."id" FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 1]]

  def new
    @entity = Entity.new
    @group = Category.new
    @categories = current_user.categories.all
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 1]]

  def create
    @entity = Entity.new(name: entity_params[:name], amount: entity_params[:amount], user_id: current_user.id)
    if @entity.save
      @categories_entites = CategoriesEntity.new(category_id: params[:category_id], entity_id: @entity.id)
      if @categories_entites.save
---
INSERT INTO "entities" ("name", "amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "sa"], ["amount", 22], ["user_id", 1], ["created_at", "2023-07-07 23:01:21.024983"], ["updated_at", "2023-07-07 23:01:21.024983"]]
INSERT INTO "categories_entities" ("category_id", "entity_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_id", 1], ["entity_id", 3], ["created_at", "2023-07-07 23:03:26.814317"], ["updated_at", "2023-07-07 23:03:26.814317"]]

  def destroy
    @category = Category.find(params[:category_id])
    @entity = @category.entities.find(params[:id])
    @entity.destroy
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "entities".* FROM "entities" INNER JOIN "categories_entities" ON "entities"."id" = "categories_entities"."entity_id" WHERE "categories_entities"."category_id" = $1 AND "entities"."id" = $2 LIMIT $3  [["category_id", 2], ["id", 6], ["LIMIT", 1]]
DELETE FROM "entities" WHERE "entities"."id" = $1  [["id", 6]]