app/controllers/pages_controller.rb

  def home
    if current_user.present?
      @categories =  Category.where(user_id: current_user.id).order(created_at: :desc) || []
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 ORDER BY "categories"."created_at" DESC  [["user_id", 2]]