app/controllers/pages_controller.rb

SELECT "categories".* FROM "categories"
---
  def home
    @categories = Category.all